package appcr.kamila.chemistrybot;

import java.util.HashMap;
import java.util.Map;

public class BotResponses {
    public static final Map<String, String> responses = new HashMap<>();

    static {
        //Приветствия
        responses.put("привет", "Добрый день!\n" +
                "Для начала работы выберите номер химической реакции из списка.\n" +
                "1. Fe + S = FeS\n" +
                "2. 2Al + 3H2O = Al2O3 + 3H2\n" +
                "3. 2HgO = 2Hg + O2\n" +
                "4. 4NH3 + 5O2 = 4NO + 6H2O\n" +
                "5. Fe + CuSO4 = FeSO4 + Cu\n" +
                "6. Zn + 2HCl = ZnCl2 + H2\n" +
                "7. MgO + H2SO4 = MgSO4 + Н2О\n" +
                "8. C + O2 = CO2\n" +
                "9. Na2O + CO2 = Na2CO3\n" +
                "10. NH3 + CO2 + H2O = NH4HCO3\n" +
                "11. 2Ag2O = 4Ag + O2\u00AD\n" +
                "12. (NH4)2Cr2O7 = N2\u00AD + Cr2O3 + 4H2O\u00AD\n" +
                "13. 2NaI + Cl2 = 2NaCl + I2\n" +
                "14. CaCO3 + SiO2 = CaSiO3 + CO2\u00AD\n" +
                "15. Ba(OH)2 + H2SO4 = BaSO4 + 2H2O\n" +
                "16. 6Li + N2 = 2Li3N\n" +
                "17. AgNO3 + NaCl = AgCl + NaNO3\n" +
                "18. Общая характеристика и химические свойства щелочных металлов\n" +
                "19. Гидриды,оксиды,пероксиды,гидроксиды щелочных металлов получение\n" +
                "20. Взаимодействие с растворами щелочей а)амфотерных металлов; б)неметаллов; в)кислотных оксидов; г)амфотерных оксидов");

        responses.put("привет!", "Добрый день!\n" +
                "Для начала работы выберите номер химической реакции из списка.\n" +
                "1. Fe + S = FeS\n" +
                "2. 2Al + 3H2O = Al2O3 + 3H2\n" +
                "3. 2HgO = 2Hg + O2\n" +
                "4. 4NH3 + 5O2 = 4NO + 6H2O\n" +
                "5. Fe + CuSO4 = FeSO4 + Cu\n" +
                "6. Zn + 2HCl = ZnCl2 + H2\n" +
                "7. MgO + H2SO4 = MgSO4 + Н2О\n" +
                "8. C + O2 = CO2\n" +
                "9. Na2O + CO2 = Na2CO3\n" +
                "10. NH3 + CO2 + H2O = NH4HCO3\n" +
                "11. 2Ag2O = 4Ag + O2\u00AD\n" +
                "12. (NH4)2Cr2O7 = N2\u00AD + Cr2O3 + 4H2O\u00AD\n" +
                "13. 2NaI + Cl2 = 2NaCl + I2\n" +
                "14. CaCO3 + SiO2 = CaSiO3 + CO2\u00AD\n" +
                "15. Ba(OH)2 + H2SO4 = BaSO4 + 2H2O\n" +
                "16. 6Li + N2 = 2Li3N\n" +
                "17. AgNO3 + NaCl = AgCl + NaNO3\n" +
                "18. Общая характеристика и химические свойства щелочных металлов\n" +
                "19. Гидриды,оксиды,пероксиды,гидроксиды щелочных металлов получение\n" +
                "20. Взаимодействие с растворами щелочей а)амфотерных металлов; б)неметаллов; в)кислотных оксидов; г)амфотерных оксидов");

        responses.put("здравствуй", "Добрый день!\n" +
                "Для начала работы выберите номер химической реакции из списка.\n" +
                "1. Fe + S = FeS\n" +
                "2. 2Al + 3H2O = Al2O3 + 3H2\n" +
                "3. 2HgO = 2Hg + O2\n" +
                "4. 4NH3 + 5O2 = 4NO + 6H2O\n" +
                "5. Fe + CuSO4 = FeSO4 + Cu\n" +
                "6. Zn + 2HCl = ZnCl2 + H2\n" +
                "7. MgO + H2SO4 = MgSO4 + Н2О\n" +
                "8. C + O2 = CO2\n" +
                "9. Na2O + CO2 = Na2CO3\n" +
                "10. NH3 + CO2 + H2O = NH4HCO3\n" +
                "11. 2Ag2O = 4Ag + O2\u00AD\n" +
                "12. (NH4)2Cr2O7 = N2\u00AD + Cr2O3 + 4H2O\u00AD\n" +
                "13. 2NaI + Cl2 = 2NaCl + I2\n" +
                "14. CaCO3 + SiO2 = CaSiO3 + CO2\u00AD\n" +
                "15. Ba(OH)2 + H2SO4 = BaSO4 + 2H2O\n" +
                "16. 6Li + N2 = 2Li3N\n" +
                "17. AgNO3 + NaCl = AgCl + NaNO3\n" +
                "18. Общая характеристика и химические свойства щелочных металлов\n" +
                "19. Гидриды,оксиды,пероксиды,гидроксиды щелочных металлов получение\n" +
                "20. Взаимодействие с растворами щелочей а)амфотерных металлов; б)неметаллов; в)кислотных оксидов; г)амфотерных оксидов");

        responses.put("здравствуй!", "Добрый день!\n" +
                "Для начала работы выберите номер химической реакции из списка.\n" +
                "1. Fe + S = FeS\n" +
                "2. 2Al + 3H2O = Al2O3 + 3H2\n" +
                "3. 2HgO = 2Hg + O2\n" +
                "4. 4NH3 + 5O2 = 4NO + 6H2O\n" +
                "5. Fe + CuSO4 = FeSO4 + Cu\n" +
                "6. Zn + 2HCl = ZnCl2 + H2\n" +
                "7. MgO + H2SO4 = MgSO4 + Н2О\n" +
                "8. C + O2 = CO2\n" +
                "9. Na2O + CO2 = Na2CO3\n" +
                "10. NH3 + CO2 + H2O = NH4HCO3\n" +
                "11. 2Ag2O = 4Ag + O2\u00AD\n" +
                "12. (NH4)2Cr2O7 = N2\u00AD + Cr2O3 + 4H2O\u00AD\n" +
                "13. 2NaI + Cl2 = 2NaCl + I2\n" +
                "14. CaCO3 + SiO2 = CaSiO3 + CO2\u00AD\n" +
                "15. Ba(OH)2 + H2SO4 = BaSO4 + 2H2O\n" +
                "16. 6Li + N2 = 2Li3N\n" +
                "17. AgNO3 + NaCl = AgCl + NaNO3\n" +
                "18. Общая характеристика и химические свойства щелочных металлов\n" +
                "19. Гидриды,оксиды,пероксиды,гидроксиды щелочных металлов получение\n" +
                "20. Взаимодействие с растворами щелочей а)амфотерных металлов; б)неметаллов; в)кислотных оксидов; г)амфотерных оксидов");

        //Реакции
        responses.put("1", "Это реакция соединения, является окислительно-восстановительной:\n" +
                "S0 + 2 e- → S-II\n" +
                "(восстановле́ние)\n" +
                "Fe0 - 2 e- → FeII\n" +
                "(окисление)\n" +
                "S является окислителем, Fe является восстановителем.");

        responses.put("2", "Это реакция разложения, является окислительно-восстановительной:\n" +
                "6 HI + 6 e- → 6 H0\n" +
                "(восстановление)\n" +
                "2 Al0 - 6 e- → 2 AlIII\n" +
                "(окисление)\n" +
                "H2O является окислителем, Al является восстановителем.");

        responses.put("3", "Это реакция разложения, является окислительно-восстановительной:\n" +
                "2 HgII + 4 e- → 2 Hg0\n" +
                "(восстановле́ние)\n" +
                "2 O-II - 4 e- → 2 O0\n" +
                "(окисление)\n" +
                "HgO является окислителем, HgO является восстановителем.");

        responses.put("4", "Это реакция замещения, является окислительно-восстановительной:\n" +
                "4 N-III - 20 e- → 4 NII\n" +
                "(окисление)\n" +
                "10 O0 + 20 e- → 10 O-II\n" +
                "(восстановление)\n" +
                "NH3 является восстановителем, O2 является окислителем.");

        responses.put("5", "Это реакция замещения, является окислительно-восстановительной:\n" +
                "CuII + 2 e- → Cu0\n" +
                "(восстановле́ние)\n" +
                "Fe0 - 2 e- → FeII\n" +
                "(окисление)\n" +
                "CuSO4 является окислителем, Fe является восстановителем.");

        responses.put("6", "Это реакция замещения, является окислительно-восстановительной:\n" +
                "Zn0 - 2 e- → ZnII\n" +
                "(окисление)\n" +
                "2 HI + 2 e- → 2 H0\n" +
                "(восстановле́ние)\n" +
                "Zn является восстановителем, HCl является окислителем.");

        responses.put("7", "Это реакция обмена, кислотно-щелочная реакция (нейтрализа́ция): MgO является щелочным, H2SO4 представляет собой кислоту.");

        responses.put("8", "Это реакция соединения, является окислительно-восстановительной:\n" +
                "C0 - 4 e- → CIV\n" +
                "(окисление)\n" +
                "2 O0 + 4 e- → 2 O-II\n" +
                "(восстановле́ние)\n" +
                "C является восстановителем, O2 является окислителем.");

        responses.put("9", "Это реакция соединения, кислотно-щелочная реакция (нейтрализа́ция): Na2O является щелочным, CO2 представляет собой кислоту.");

        responses.put("10", "Это реакция соединения, не проявляет окислительно-восстановительных свойств, NH4HCO3 - это неорганическое вещество, гидрокарбонат аммония.");

        responses.put("11", "Это реакция разложения, является окислительно-восстановительной:\n" +
                "4 AgI + 4 e- → 4 Ag0\n" +
                "(восстановле́ние)\n" +
                "2 O-II - 4 e- → 2 O0\n" +
                "(окисление)\n" +
                "Ag2O является окислителем, Ag2O является восстановителем.");

        responses.put("12", "Это реакция разложения, является окислительно-восстановительной:\n" +
                "2 N-III - 6 e- → 2 N0\n" +
                "(окисление)\n" +
                "2 CrVI + 6 e- → 2 CrIII\n" +
                "(восстановле́ние)\n" +
                "(NH4)2Cr2O7 является восстановителем, (NH4)2Cr2O7 является окислителем.");

        responses.put("13", "Это реакция замещения, является окислительно-восстановительной:\n" +
                "2 I-I - 2 e- → 2 I0\n" +
                "(окисление)\n" +
                "2 Cl0 + 2 e- → 2 Cl-I\n" +
                "(восстановле́ние)\n" +
                "NaI является восстановителем, Cl является окислителем.");

        responses.put("14", "Это реакция замещения, кислотно-щелочная реакция (нейтрализа́ция): CaCO3 является щелочным, SiO2 представляет собой кислоту.");

        responses.put("15", "Это реакция обмена, кислотно-щелочная реакция (нейтрализа́ция): Ba(OH)2 является щелочным, H2SO4 представляет собой кислоту.");

        responses.put("16", "Это реакция соединения, является окислительно-восстановительной:\n" +
                "6 Li0 - 6 e- → 6 LiI\n" +
                "(окисление)\n" +
                "2 N0 + 6 e- → 2 N-III\n" +
                "(восстановление)\n" +
                "Li является восстановителем, N2 является окислителем.");

        responses.put("17", "Это реакция обмена, реакция осаждения: AgCl сформированный осаждаться (преципитатом).");

        responses.put("18", "Физические свойства\n" +
                "Низкие температуры плавления, малые\n" +
                "значения плотностей, мягкие, режутся\n" +
                "ножом.\n" +
                "Низкий потенциал ионизации, который\n" +
                "уменьшается с увеличением атомного\n" +
                "номера.\n" +
                "Химические свойства\n" +
                "Типичные металлы, очень сильные\n" +
                "восстановители. В соединениях\n" +
                "проявляют единственную степень\n" +
                "окисления +1. Восстановительная\n" +
                "способность увеличивается с ростом\n" +
                "атомной массы Li Na K Rb Cs.\n" +
                "Все соединения имеют ионный\n" +
                "характер, почти все растворимы в воде.\n" +
                "Гидроксиды== ROH щёлочи, сила их\n" +
                "возрастает с увеличением атомной\n" +
                "массы металла.\n" +
                "Воспламеняются на воздухе при\n" +
                "умеренном нагревании. С водородом\n" +
                "образуют солеобразные гидриды.\n" +
                "Продукты сгорания чаще всего\n" +
                "пероксиды.\n" +
                "1. Активно взаимодействуют с водой:\n" +
                "2Na + 2H2O = 2NaOH + H2\n" +
                "2Li + 2H2O = 2LiOH + H2\n" +
                "2. Реакция с кислотами:\n" +
                "2Na + 2HCl = 2NaCl + H2-\n" +
                "3. Реакция с кислородом:\n" +
                "4Li + O2 = 2Li2O(оксид лития)\n" +
                "2Na + O2 = Na2O2(пероксид натрия)\n" +
                "K + O2 = KO2(надпероксид калия)\n" +
                "На воздухе щелочные металлы\n" +
                "мгновенно окисляются. Поэтому их\n" +
                "хранят под слоем органических\n" +
                "растворителей (керосин и др.).\n" +
                "4. В реакциях с другими неметаллами\n" +
                "образуются бинарные соединения:\n" +
                "2Li + Cl2 = 2LiCl(галогениды)\n" +
                "2Na + S = Na2S(сульфиды)\n" +
                "2Na + H2 = 2NaH(гидриды)\n" +
                "6Li + N2 = 2Li3N(нитриды)\n" +
                "2Li + 2C = 2Li2C2(карбиды)\n" +
                "Нахождение в природе\n" +
                "Li\n" +
                "Li2O • Al2O3 • 4SiO2 сподумен\n" +
                "Na\n" +
                "NaCl каменная соль\n" +
                "Na2SO4 • 10H2O глауберова соль\n" +
                "(мирабилит)\n" +
                "NaNO3 чилийская селитра\n" +
                "K\n" +
                "KCl • NaCl сильвинит\n" +
                "KCl • MgCl2 • 6H2O карналлит\n" +
                "K2O • Al2O3 • 6SiO2 полевой шпат\n" +
                "(ортоклаз)");

        responses.put("19", "Щелочные металлы образуют\n" +
                "соединения с преимущественно\n" +
                "ионной связью\n" +
                "Оксиды.Получение\n" +
                "Все оксиды (кроме Li2O) получают при\n" +
                "нагревании смеси пероксида (или\n" +
                "надпероксида) с избытком металла:\n" +
                "Na2O2 + 2Na >2Na2O\n" +
                "KO2 + 3K>2K2O\n" +
                "Химические свойства\n" +
                "Типичные основные оксиды.\n" +
                "Реагируют с водой, кислотными\n" +
                "оксидами и кислотами:\n" +
                "Li2O + H2O = 2LiOH\n" +
                "Na2O + SO3 = Na2SO4\n" +
                "K2O + 2HNO3 = 2KNO3 + H2O\n" +
                "Пероксид натрия Na2O2\n" +
                "1. Сильный окислитель:\n" +
                "2NaI+Na2O2+2H2SO4=I2+2Na2SO4+2H2O\n" +
                "2Na2O2 + 2CO2 = 2Na2CO3 + O2\n" +
                "2. Разлагается водой:\n" +
                "Na2O2 + 2H2O = 2NaOH + H2O2\n" +
                "Надпероксид калия KO2\n" +
                "Получение\n" +
                "2Na + O2 = Na2O2\n" +
                "Гидриды реагируют с водой и\n" +
                "кислородом:\n" +
                "MeH+H2O=MeOH+H2; 2MeH+O2=2MeOH\n" +
                "Получение\n" +
                "2Na + H2 =2NaH\n" +
                "Гидроксиды щелочных металлов.\n" +
                "Белые, кристаллические\n" +
                "вещества,;хорошо растворимы в воде В\n" +
                "водных растворах диссоциированы.\n" +
                "Получение\n" +
                "1. Электролиз растворов хлоридов:\n" +
                "2NaCl + 2H2O = 2NaOH + H2 + Cl2\n" +
                "катод: 2H+ + 2e= H02\n" +
                "анод: 2Cl- - 2e =Cl02\n" +
                "2.Обменные реакции между солью и\n" +
                "основанием:\n" +
                "K2CO3 + Ca(OH)2 = CaCO3 + 2KOH\n" +
                "3. Взаимодействие металлов или их\n" +
                "основных оксидов (или пероксидов и\n" +
                "надпероксидов) с водой:\n" +
                "2Li + 2H2O = 2LiOH + H2\n" +
                "Li2O + H2O = 2LiOH\n" +
                "Na2O2 + 2H2O = 2NaOH + H2O2\n" +
                "Химические свойства.\n" +
                "2LiOH+H2SO4=Li2SO4+2H2O\n" +
                "2KOH+CO2=K2CO3+H2O\n" +
                "KOH+Al(OH)3=K[Al(OH)4]\n" +
                "при прокаливании разлагается на\n" +
                "оксид и воду\n" +
                "2LiOH>Li2O+H2O\n" +
                "пероксиды и надпероксиды реагируют\n" +
                "с водой:\n" +
                "Ме2O2 + 2 H2O = 2 МеOH + H2O2\n" +
                "2 МеO2 + 2 H2O = 2 МеOH + H2O2 + O2\n" +
                "с кислотными оксидами и кислотами:\n" +
                "Me2O2 + H2SO4 = Me2SO4 + H2O2\n" +
                "4MeO2 + 2CO2 = 2Me2CO3 + 3O2\n" +
                "являются сильными окислителями:\n" +
                "Me2O2+2FeSO4+2H2SO4>Fe2(SO4)3+Me\n" +
                "2SO4+2H2O\n" +
                "но могут и сами окисляться:\n" +
                "5Me2O2+2KMnO4+8H2SO4>2MnSO4+5\n" +
                "Me2SO4+K2SO4+8H2O+5O2\n" +
                "Получение: Li + O2 = 2 Li2O\n" +
                "2 Na + O2 = Na2O2\n" +
                "K + O2 = KO2");

        responses.put("20", "А)Zn+2NaOH=(t)Na2ZnO2+H2\n" +
                "Al+2KOH=(t)2KAlO2+H2\n" +
                "Б)6NaOH+3Cl2>(t)5NaCl+NaClO3+3H2O\n" +
                "В) CO2+2NaOH=Na2CO3+H2O\n" +
                "2NaOH + SO3>Na2SO4 + H2O\n" +
                "NaOH + SO3>NaHSO4\n" +
                "Г) 2NaOH + ZnO + H2O >Na2[Zn(OH)4]\n" +
                "ZnO + 2 NaOH => Na2ZnO2 + H2O");

        //Разное
        responses.put("как дела?", "Всё отлично, спасибо!");
        responses.put("как дела", "Всё отлично, спасибо!");
        responses.put("как у тебя дела?", "Всё отлично, спасибо!");
        responses.put("как у тебя дела", "Всё отлично, спасибо!");
    }
}
